In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Alumnos.csv')

In [3]:
df

   Nombre   Edad Genero       Carrera Semestre
0   Victor    28      M     Auditoria  Primero
1    Laura    23      F   Informatica  Primero
2     Raul    26      M       Derecho   Quinto
3    Lucia    27      F   Informatica  Septimo
4  Rodrigo    22      M       Derecho  Tercero
5     Luis    25      M  Arquitectura  Septimo
6      Ana    23      F   Informatica  Primero
7  Joaquin    24      M      Economia   Noveno

In [30]:
df.iloc[0,0]

'Victor'

In [7]:
df.iloc[2,:5]

Nombre         Raul
Edad             26
Genero            M
Carrera     Derecho
Semestre     Quinto
Name: 2, dtype: object

In [23]:
df.loc[2,'Semestre']

'Quinto'

In [25]:
df.loc[:3, ('Semestre', 'Edad')]

  Semestre  Edad
0  Primero    28
1  Primero    23
2   Quinto    26
3  Septimo    27

In [32]:
# Añadir columnas

In [36]:
df['Turnos'] = pd.Series(['Tarde','Mañanas','Mañanas','Mañanas','Tarde','Tarde','Mañanas','Tarde'])

In [37]:
df

   Nombre   Edad Genero       Carrera Semestre   Turnos
0   Victor    28      M     Auditoria  Primero    Tarde
1    Laura    23      F   Informatica  Primero  Mañanas
2     Raul    26      M       Derecho   Quinto  Mañanas
3    Lucia    27      F   Informatica  Septimo  Mañanas
4  Rodrigo    22      M       Derecho  Tercero    Tarde
5     Luis    25      M  Arquitectura  Septimo    Tarde
6      Ana    23      F   Informatica  Primero  Mañanas
7  Joaquin    24      M      Economia   Noveno    Tarde

In [39]:
semestre = df.pop('Semestre')

In [40]:
df

   Nombre   Edad Genero       Carrera   Turnos
0   Victor    28      M     Auditoria    Tarde
1    Laura    23      F   Informatica  Mañanas
2     Raul    26      M       Derecho  Mañanas
3    Lucia    27      F   Informatica  Mañanas
4  Rodrigo    22      M       Derecho    Tarde
5     Luis    25      M  Arquitectura    Tarde
6      Ana    23      F   Informatica  Mañanas
7  Joaquin    24      M      Economia    Tarde

In [65]:
new_row = pd.Series(['Beatriz', '21', 'F', 'Ingieneria', 'Mañanas'], index=['Nombre', 'Edad', 'Genero', 'Carrera', 'Turnos'])

In [68]:
df = pd.concat([df,new_row.to_frame().T], ignore_index=True)

In [69]:
df.to_csv('Alumnos.csv', index=False)

In [70]:
df

    Nombre Edad Genero     Carrera   Turnos
0  Beatriz   21      F  Ingieneria  Mañanas
1  Beatriz   21      F  Ingieneria  Mañanas
2  Beatriz   21      F  Ingieneria  Mañanas
3  Beatriz   21      F  Ingieneria  Mañanas